# AirViscosity Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctSettings..::..AirViscosity Property
DuctSettings Class See Also
---
The kinematic viscosity of air in ft^2/s.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double AirViscosity { get; set; }
```

Visual Basic
---
```text
Public Property AirViscosity As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double AirViscosity {
	double get ();
	void set (double value);
}
```

# See Also
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace